# -*- coding: utf-8 -*-
"""
Created on Tue Feb 28 11:08:35 2017

@author: tehn-11
"""
#==============================================================================
# Задание по программированию: Опорные объекты
#==============================================================================
import pandas
from sklearn.svm import SVC
 
#==============================================================================
# Загрузите выборку из файла svm-data.csv. 
# В нем записана двумерная выборка (целевая переменная указана в первом столбце, признаки — во втором и третьем).
#==============================================================================
data = pandas.read_csv('svm-data.csv', header=None)
y_train = data[0]#Класс
X_train = data.loc[:, 1:]#Характеристики

#==============================================================================
# Обучите классификатор с линейным ядром, параметром C = 100000 и random_state=241. 
# Такое значение параметра нужно использовать, чтобы убедиться, 
# что SVM работает с выборкой как с линейно разделимой. 
# При более низких значениях параметра алгоритм будет настраиваться с учетом 
# слагаемого в функционале, штрафующего за маленькие отступы, 
# из-за чего результат может не совпасть с решением классической задачи SVM для линейно разделимой выборки.
#==============================================================================
clf = SVC(C = 100000,random_state=241,kernel='linear')
clf.fit(X_train, y_train)

#Индексы опорных объектов обученного классификатора хранятся в поле support_
print(clf.support_)